Repository: miurahr/translate-django-ja
Catalog: tm/django.tmx
Source language: en_us
Languages: ja

source: Django documentation
ja: Django ドキュメント

source: Everything you need to know about Django.
ja: Django を使いこなすための全てがここにあります。

source: Getting help
ja: 助けを求める

source: Having trouble? We'd like to help!
ja: 困り事ですか？手を貸しましょう！

source: Try the :doc:`FAQ <faq/index>` -- it's got answers to many common questions.
ja: * :doc:`FAQ <faq/index>` を探しましょう。よくある質問への答えなら、ここで見つかります。

source: Looking for specific information? Try the :ref:`genindex`, :ref:`modindex` or the :doc:`detailed table of contents <contents>`.
ja: * 特定のトピックについて情報を探しているなら、 :doc:`genindex` や :doc:`modindex` 、 :doc:`内容の詳細な表 <contents>` を見てください。

source: Search for information in the archives of the |django-users| mailing list, or `post a question`_.
ja: |django-users| メーリングリストで検索して調べるか､ `質問を投稿してください`_.

source: Ask a question in the `#django IRC channel`_, or search the `IRC logs`_ to see if it's been asked before.
ja: * `IRC の #django チャネル`_ で質問したり、質問する前に `IRC のログ`_ を探したりしてみましょう。

source: Report bugs with Django in our `ticket tracker`_.
ja: * Django のバグを見つけたら、 `チケットトラッカ`_ で報告してください。

source: First steps
ja: 最初のステップ

source: Are you new to Django or to programming? This is the place to start!
ja: Djangoやプログラミングは初めてですか？ここから始めましょう！

source: **From scratch:** :doc:`Overview <intro/overview>` | :doc:`Installation <intro/install>`
ja: **何もないところから始めるなら:** :doc:`概要 <intro/overview>` | :doc:`インストール <intro/install>`

source: **Advanced Tutorials:** :doc:`How to write reusable apps <intro/reusable-apps>` | :doc:`Writing your first patch for Django <intro/contributing>`
ja: **高度なチュートリアル:** :doc:`再利用可能なアプリケーションな書き方 <intra/reusable-apps>' | :doc:`Django へのパッチを初めて書くには <intro/contributing>`

source: The model layer
ja: モデル層

source: Django provides an abstraction layer (the "models") for structuring and manipulating the data of your Web application. Learn more about it below:
ja: Django は Web アプリケーションのデータ構造を定義、操作するための抽象レイヤ ("モデル") を提供しています。詳細は以下になります:

source: **Model instances:** :doc:`Instance methods <ref/models/instances>` | :doc:`Accessing related objects <ref/models/relations>`
ja: **モデルインスタンス詳説:** :doc:`インスタンスメソッド解説 <ref/models/instances>` | :doc:`リレーション先オブジェクトへのアクセス <ref/models/relations>`

source: The view layer
ja: ビュー層

source: Django has the concept of "views" to encapsulate the logic responsible for processing a user's request and for returning the response. Find all you need to know about views via the links below:
ja: Django には "ビュー" という概念があります。ビューはユーザーリクエストを処理し、レスポンスを返すロジックをカプセル化したものです。ビューについて知るべきことは、全て以下のリンクにあります:

source: **The basics:** :doc:`URLconfs <topics/http/urls>` | :doc:`View functions <topics/http/views>` | :doc:`Shortcuts <topics/http/shortcuts>` | :doc:`Decorators <topics/http/decorators>`
ja: **ビューの基本:** :doc:`URLconf とは <topics/http/urls>` | :doc:`ビュー関数とは <topics/http/views>` | :doc:`便利なショートカット <topics/http/shortcuts>` | :doc:`デコレータ <topics/http/decorators>`

source: **Reference:** :doc:`Built-in Views <ref/views>` | :doc:`Request/response objects <ref/request-response>` | :doc:`TemplateResponse objects <ref/template-response>`
ja: **リファレンス:** :doc:`組み込みのビュー <ref/views>` | :doc:`リクエスト/レスポンスオブジェクト <ref/request-response>` | :doc:`テンプレートレスポンスオブジェクト <ref/template-response>`

source: **File uploads:** :doc:`Overview <topics/http/file-uploads>` | :doc:`File objects <ref/files/file>` | :doc:`Storage API <ref/files/storage>` | :doc:`Managing files <topics/files>` | :doc:`Custom storage <howto/custom-file-storage>`
ja: **ファイルアップロードに対応するには:** :doc:`ファイルアップロード対応の概要 <topics/http/file-uploads>` | :doc:`File オブジェクトリファレンス <ref/files/file>` | :doc:`ストレージ API <ref/files/storage>` | :doc:`ファイルの管理 <topics/files>` | :doc:`ストレージを自作するには <howto/custom-file-storage>`

source: **Class-based views:** :doc:`Overview <topics/class-based-views/index>` | :doc:`Built-in display views <topics/class-based-views/generic-display>` | :doc:`Built-in editing views <topics/class-based-views/generic-editing>` | :doc:`Using mixins <topics/class-based-views/mixins>` | :doc:`API reference <ref/class-based-views/index>` | :doc:`Flattened index<ref/class-based-views/flattened-index>`
ja: **クラスベースビュー:** :doc:`クラスベースビューの概要 <topics/class-based-views/index>` | :doc:`組み込みの表示用ビュー <topics/class-based-views/generic-display>` | :doc:`組み込みの編集用ビュー <topics/class-based-views/generic-editing>` | :doc:`Mixin を使うには <topics/class-based-views/mixins>` | :doc:`API リファレンス <ref/class-based-views/index>` | :doc:`索引<ref/class-based-views/flattened-index>`

source: **Advanced:** :doc:`Generating CSV <howto/outputting-csv>` | :doc:`Generating PDF <howto/outputting-pdf>`
ja: **より高度なビューの話題:** :doc:`CSV を出力するには <howto/outputting-csv>` | :doc:`PDF を出力するには <howto/outputting-pdf>`

source: **Middleware:** :doc:`Overview <topics/http/middleware>` | :doc:`Built-in middleware classes <ref/middleware>`
ja: **ミドルウェア:** :doc:`ミドルウェアとは <topics/http/middleware>` | :doc:`組み込みのミドルウェアクラス <ref/middleware>`

source: The template layer
ja: テンプレート層

source: The template layer provides a designer-friendly syntax for rendering the information to be presented to the user. Learn how this syntax can be used by designers and how it can be extended by programmers:
ja: テンプレート層はユーザに提示される情報の描画を行います。テンプレートはデザイナーに書きやすいものになっています。テンプレートの構文がデザイナーにどのように使われるか、またプログラマーがどのように拡張できるのかを学びましょう:

source: **For programmers:** :doc:`Template API <ref/templates/api>` | :doc:`Custom tags and filters <howto/custom-template-tags>`
ja: **プログラマー向けの情報:** :doc:`テンプレート API <ref/templates/api>` | :doc:`タグやフィルタを自作するには <howto/custom-template-tags>`

source: Forms
ja: フォーム

source: Django provides a rich framework to facilitate the creation of forms and the manipulation of form data.
ja: Django はフォームの作成とフォームデータの操作を容易にする、多機能フレームワークを提供しています。

source: **The basics:** :doc:`Overview <topics/forms/index>` | :doc:`Form API <ref/forms/api>` | :doc:`Built-in fields <ref/forms/fields>` | :doc:`Built-in widgets <ref/forms/widgets>`
ja: **フォームの基礎:** :doc:`フォーム機能の概要 <topics/forms/index>` | :doc:`フォーム API <ref/forms/api>` | :doc:`組み込みフォームフィールドリファレンス <ref/forms/fields>` | :doc:`組み込みウィジェットリファレンス <ref/forms/widgets>`

source: **Advanced:** :doc:`Forms for models <topics/forms/modelforms>` | :doc:`Integrating media <topics/forms/media>` | :doc:`Formsets <topics/forms/formsets>` | :doc:`Customizing validation <ref/forms/validation>`
ja: **高度な話題:** :doc:`モデルに対応したフォームを生成するには <topics/forms/modelforms>` | :doc:`メディアファイルを組み込むには <topics/forms/media>` | :doc:`フォームセットを扱うには <topics/forms/formsets>` | :doc:`バリデータを自作するには <ref/forms/validation>`

source: The development process
ja: 開発プロセス

source: Learn about the various components and tools to help you in the development and testing of Django applications:
ja: Django アプリケーションの開発とテストに役立つ、さまざまなコンポーネントとツールについて学ましょう:

source: **Settings:** :doc:`Overview <topics/settings>` | :doc:`Full list of settings <ref/settings>`
ja: **設定:** :doc:`設定ファイルとは <topics/settings>` | :doc:`設定項目リファレンス <ref/settings>`

source: **Applications:** :doc:`Overview <ref/applications>`
ja: **アプリケーション:** :doc:`概要 <ref/applications>`

source: **Exceptions:** :doc:`Overview <ref/exceptions>`
ja: **例外:** :doc:`例外の概要 <ref/exceptions>`

source: The admin
ja: 管理インタフェース

source: Find all you need to know about the automated admin interface, one of Django's most popular features:
ja: Django の目玉機能の一つである、自動生成の管理インタフェースのすべてを学べます:

source: :doc:`Admin site <ref/contrib/admin/index>`
ja: :doc:`管理サイト <ref/contrib/admin/index>`

source: :doc:`Admin actions <ref/contrib/admin/actions>`
ja: :doc:`管理アクションを組み込むには <ref/contrib/admin/actions>`

source: :doc:`Admin documentation generator<ref/contrib/admin/admindocs>`
ja: :doc:`管理サイトのドキュメントを生成する<ref/contrib/admin/admindocs>`

source: Security
ja: セキュリティ

source: Security is a topic of paramount importance in the development of Web applications and Django provides multiple protection tools and mechanisms:
ja: セキュリティは Web アプリケーションを開発するなかで最も重要なトピックです。 Django は複数のプロテクションツールとメカニズムを提供しています:

source: :doc:`Security overview <topics/security>`
ja: :doc:`セキュリティの概要 <topics/security>`

source: :doc:`Disclosed security issues in Django <releases/security>`
ja: :doc:`Django のセキュリティ問題についてはこちらを参照 <releases/security>`

source: :doc:`Clickjacking protection <ref/clickjacking>`
ja: :doc:`クリックジャッキング対策 <ref/clickjacking>`

source: :doc:`Cryptographic signing <topics/signing>`
ja: :doc:`暗号による署名 <topics/signing>`

source: :ref:`Security Middleware <security-middleware>`
ja: :ref:`ミドルウェアのセキュリティ <security-middleware>`

source: Internationalization and localization
ja: 国際化と局地化

source: Django offers a robust internationalization and localization framework to assist you in the development of applications for multiple languages and world regions:
ja: Django は堅牢な国際化 (internationalization) 、ローカライズ (localization) フレームワークを提供しています。多言語、世界の各地域に対応したアプリケーションを開発する助けになります:

source: :doc:`Overview <topics/i18n/index>` | :doc:`Internationalization <topics/i18n/translation>` | :ref:`Localization <how-to-create-language-files>` | :doc:`Localized Web UI formatting and form input <topics/i18n/formatting>`
ja: :doc:`概要 <topics/i18n/index>` | :doc:`国際化 <topics/i18n/translation>` | :ref:`地域化 <how-to-create-language-files>` | :doc:`地域化されたUIフォーマットとフォームインプット <topics/i18n/formatting>`

source: :doc:`"Local flavor" <topics/localflavor>`
ja: :doc:`"ローカルフレーバー" <topics/localflavor>`

source: :doc:`Time zones </topics/i18n/timezones>`
ja: :doc:`タイムゾーン </topics/i18n/timezones>`

source: Performance and optimization
ja: パフォーマンスと最適化

source: :doc:`Performance and optimization overview <topics/performance>`
ja: :doc:`パフォーマンスと最適化の概要 <topics/performance>`

source: Python compatibility
ja: 異なる Python への互換性

source: Django aims to be compatible with multiple different flavors and versions of Python:
ja: Django は複数の異なる Python のバージョン、実装に互換性があります:

source: :doc:`Jython support <howto/jython>`
ja: Jython で動かす

source: :doc:`Python 3 compatibility <topics/python3>`
ja: Python 3 対応

source: Geographic framework
ja: ジオグラフィックフレームワーク

source: :doc:`GeoDjango <ref/contrib/gis/index>` intends to be a world-class geographic Web framework.
ja: :doc:`GeoDjango <ref/contrib/gis/index>` は世界規模のジオグラフィック Web フレームワークを目指しています。

source: Its goal is to make it as easy as possible to build GIS Web applications and harness the power of spatially enabled data.
ja: GeoDjango の目的は、地理情報システム (GIS) のWeb アプリケーションの開発をより簡単にし、空間データ (spatially enabled data) を活用することにあります。

source: Common Web application tools
ja: 一般的な Web アプリケーションツール群

source: Django offers multiple tools commonly needed in the development of Web applications:
ja: Django は Web アプリケーションの開発でいつも必要になるツール群を提供しています:

source: :doc:`Caching <topics/cache>`
ja: :doc:`キャッシュシステム <topics/cache>`

source: :doc:`Logging <topics/logging>`
ja: :doc:`ログ出力 <topics/logging>`

source: :doc:`Sending emails <topics/email>`
ja: :doc:`メール送信 <topics/email>`

source: :doc:`Syndication feeds (RSS/Atom) <ref/contrib/syndication>`
ja: :doc:`配信フィード (RSS/Atom) <ref/contrib/syndication>`

source: :doc:`Pagination <topics/pagination>`
ja: :doc:`ページ分割表示 <topics/pagination>`

source: :doc:`Messages framework <ref/contrib/messages>`
ja: :doc:`メッセージフレームワーク <ref/contrib/messages>`

source: :doc:`Serialization <topics/serialization>`
ja: :doc:`データのシリアライズ <topics/serialization>`

source: :doc:`Sessions <topics/http/sessions>`
ja: :doc:`セッションデータの操作 <topics/http/sessions>`

source: :doc:`Sitemaps <ref/contrib/sitemaps>`
ja: :doc:`サイトマップ <ref/contrib/sitemaps>`

source: :doc:`Static files management <ref/contrib/staticfiles>`
ja: :doc:`静的ファイルの扱い方 <ref/contrib/staticfiles>`

source: :doc:`Data validation <ref/validators>`
ja: :doc:`バリデータ <ref/validators>`

source: Other core functionalities
ja: その他のコア機能

source: Learn about some other core functionalities of the Django framework:
ja: Django フレームワークの、その他の主要機能について学びましょう:

source: :doc:`Conditional content processing <topics/conditional-view-processing>`
ja: :doc:`条件付きコンテンツ処理 <topics/conditional-view-processing>`

source: :doc:`Content types and generic relations <ref/contrib/contenttypes>`
ja: :doc:`コンテンツタイプと汎用リレーション <ref/contrib/contenttypes>`

source: :doc:`Flatpages <ref/contrib/flatpages>`
ja: :doc:`flatpages: フラットページコンテンツの管理 <ref/contrib/flatpages>`

source: :doc:`Redirects <ref/contrib/redirects>`
ja: :doc:`リクエストのリダイレクト <ref/contrib/redirects>`

source: :doc:`Signals <topics/signals>`
ja: :doc:`イベントのシグナル <topics/signals>`

source: :doc:`The sites framework <ref/contrib/sites>`
ja: :doc:`サイトフレームワーク <ref/contrib/sites>`

source: :doc:`Unicode in Django <ref/unicode>`
ja: :doc:`Django での Unicode の扱い方 <ref/unicode>`

source: The Django open-source project
ja: オープンソースプロジェクトとしての Django

source: Learn about the development process for the Django project itself and about how you can contribute:
ja: Django プロジェクト自身の開発プロセスと、どのようにプロジェクトに貢献するのかを学びましょう:

source: **Design philosophies:** :doc:`Overview <misc/design-philosophies>`
ja: **設計哲学:** :doc:`概要 <misc/design-philosophies>`

source: **Documentation:** :doc:`About this documentation <internals/contributing/writing-documentation>`
ja: **ドキュメントの仕組み:** :doc:`ドキュメントの仕組みと書き方 <internals/contributing/writing-documentation>`

source: **Third-party distributions:** :doc:`Overview <misc/distributions>`
ja: **サードパーティが配布している Django:** :doc:`概要と、ディストリビュータへのお願い <misc/distributions>`

source: **Django over time:** :doc:`API stability <misc/api-stability>` | :doc:`Release notes and upgrading instructions <releases/index>` | :doc:`Deprecation Timeline <internals/deprecation>`
ja: **Django と長く付き合うために:** :doc:`どの API が安定なのか <misc/api-stability>` | :doc:`リリースノート一覧とアップグレードの手順 <releases/index>` | :doc:`不要な機能の撤廃、削除スケジュール <internals/deprecation>`

source: Django documentation contents
ja: Django ドキュメント目次

source: Indices, glossary and tables
ja: 索引、モジュール一覧、用語集

source: Writing your first patch for Django
ja: Django への初めてのパッチを書く

source: Introduction
ja: はじめに

source: Interested in giving back to the community a little?
ja: 少しでもコミュニティへ恩返しをしたいと思われますか?

source: Maybe you've found a bug in Django that you'd like to see fixed, or maybe there's a small feature you want added.
ja: それは Django の簡単なバグフィックスや小さな機能追加かもしれません。

source: Contributing back to Django itself is the best way to see your own concerns addressed. This may seem daunting at first, but it's really pretty simple. We'll walk you through the entire process, so you can learn by example.
ja: その願いを叶える最適な方法は Django 自体への貢献です。最初は気が重いかもしれませんが、実際はとても簡単です。私達がプロセス全体を詳しく解説するので、その例から学ぶことができるでしょう。

source: Who's this tutorial for?
ja: このチュートリアルは誰を対象としていますか?

source: For this tutorial, we expect that you have at least a basic understanding of how Django works. This means you should be comfortable going through the existing tutorials on :doc:`writing your first Django app</intro/tutorial01>`. In addition, you should have a good understanding of Python itself. But if you don't, `Dive Into Python`__ is a fantastic (and free) online book for beginning Python programmers.
ja: このチュートリアルは、少なくとも Django がどのように動作しているかの基本的な理解があることを想定しています。つまりチュートリアル :doc:`初めての Django アプリ</intro/tutorial01>` を十分に理解していることを想定しています。また、Python 自体をよく理解している必要があります。もしそうでない場合、 `Dive Into Python`__ は Python プログラマーになるための素晴らしい (かつ無料の) オンラインドキュメントです。

source: Those of you who are unfamiliar with version control systems and Trac will find that this tutorial and its links include just enough information to get started. However, you'll probably want to read some more about these different tools if you plan on contributing to Django regularly.
ja: バージョン管理システムと Trac をよく知らない方でも、このチュートリアルとリンク先から、始めるに十分な情報を得ることができます。しかし、Django に定期的に貢献したい場合は、このツールの詳細について知りたいかもしれません。

source: For the most part though, this tutorial tries to explain as much as possible, so that it can be of use to the widest audience.
ja: このチュートリアルでは、できるだけ多くの方が使用できるように可能な限り解説したいと思います。

source: Where to get help:
ja: 困ったときは:

source: What does this tutorial cover?
ja: このチュートリアルの範囲はなんですか?

source: We'll be walking you through contributing a patch to Django for the first time. By the end of this tutorial, you should have a basic understanding of both the tools and the processes involved. Specifically, we'll be covering the following:
ja: 初めて Django にパッチを送る手順を詳しく解説します。このチュートリアルを終えると、関連するツールとプロセス両方についての基本的な理解を得ることができます。具体的な範囲は以下の通りです:

source: Installing Git.
ja: Git のインストール

source: How to download a development copy of Django.
ja: 開発版の Django の複製をダウンロード

source: Running Django's test suite.
ja: Django のテストスイートの実行

source: Writing a test for your patch.
ja: パッチへのテストを書く

source: Writing the code for your patch.
ja: パッチのコードを書く

source: Testing your patch.
ja: パッチをテスト

source: Generating a patch file for your changes.
ja: 変更のパッチファイルを生成

source: Where to look for more information.
ja: より多くの情報を得る方法

source: Once you're done with the tutorial, you can look through the rest of :doc:`Django's documentation on contributing</internals/contributing/index>`. It contains lots of great information and is a must read for anyone who'd like to become a regular contributor to Django. If you've got questions, it's probably got the answers.
ja: チュートリアルを終えたら、次は :doc:`Django への貢献</internals/contributing/index>` を参照してください。このドキュメントには、多くの重要な情報が含まれており、Django に定期的に貢献したい方は是非一読してください。あなたの疑問への答えが見つかるはずです。

source: Installing Git
ja: Git のインストール

source: For this tutorial, you'll need Git installed to download the current development version of Django and to generate patch files for the changes you make.
ja: このチュートリアルでは、最新の Django 開発版のダウンロードとその変更のパッチファイルを生成するために Git をインストールする必要があります。

source: If you're not that familiar with Git, you can always find out more about its commands (once it's installed) by typing ``git help`` into the command line.
ja: もし Git について詳しく知らない場合は、(インストール後に) コマンドラインから ``git help`` と入力するとコマンドの使い方を確認できます。

source: Getting a copy of Django's development version
ja: Django 開発版の複製を取得

source: The first step to contributing to Django is to get a copy of the source code. From the command line, use the ``cd`` command to navigate to the directory where you'll want your local copy of Django to live.
ja: Django への貢献の第一歩はソースコードの複製の取得から始まります。コマンドラインで、 ``cd`` コマンドを使い、Django をローカルに複製するディレクトリに移動します。

source: Download the Django source code repository using the following command::
ja: 以下のコマンドで Django のソースコードリポジトリをダウンロードします::

source: For users who wish to use `virtualenv`__, you can use::
ja: `virtualenv`__ を利用したい場合は、次のコマンドを使います::

source: (where ``django`` is the directory of your clone that contains ``setup.py``) to link your cloned checkout into a virtual environment. This is a great option to isolate your development copy of Django from the rest of your system and avoids potential package conflicts.
ja: (``django`` ディレクトリの複製には ``setup.py`` が含まれています) このコマンドにより、仮想環境内にこの複製をインストールできます。これにより Django の開発用の複製を他のシステムから分離できるため、パッケージの依存問題から開放されます。

source: Rolling back to a previous revision of Django
ja: 旧リビジョンの Django に戻す

source: **Keep in mind that while we'll be using an older revision of Django's trunk for the purposes of the tutorial below, you should always use the current development revision of Django when working on your own patch for a ticket!**
ja: **チュートリアルでは trunk ではない古いリビジョンの Django を使用しますが、自分のパッチを作成する場合は Django の最新の開発版を使用する必要があります!**

source: The patch for this ticket was written by Ulrich Petri, and it was applied to Django as `commit ac2052ebc84c45709ab5f0f25e685bf656ce79bc`__. Consequently, we'll be using the revision of Django just prior to that, `commit 39f5bc7fc3a4bb43ed8a1358b17fe0521a1a63ac`__.
ja: このチケットのパッチは Ulrich Petri 氏により書かれ、これは `commit ac2052ebc84c45709ab5f0f25e685bf656ce79bc`__ で Django に適用されました。よって `commit 39f5bc7fc3a4bb43ed8a1358b17fe0521a1a63ac`__ が適用される前の Django のリビジョンを使用します。

source: Navigate into Django's root directory (that's the one that contains ``django``, ``docs``, ``tests``, ``AUTHORS``, etc.). You can then check out the older revision of Django that we'll be using in the tutorial below::
ja: Django のルートディレクトリ (このディレクトリには ``django``, ``docs``, ``tests``, ``AUTHORS``, 等が含まれています) へ移動します。次にチュートリアルで使用する Django の旧リビジョンをチェックアウトします。

source: Running Django's test suite for the first time
ja: 最初に Django のテストスイートを実行する

source: When contributing to Django it's very important that your code changes don't introduce bugs into other areas of Django. One way to check that Django still works after you make your changes is by running Django's test suite. If all the tests still pass, then you can be reasonably sure that your changes haven't completely broken Django. If you've never run Django's test suite before, it's a good idea to run it once beforehand just to get familiar with what its output is supposed to look like.
ja: Django へ貢献する際、変更したコードが Django の他の領域にバグをの変更はジャンゴの他の領域にバグを混入しないことが非常に重要です。変更後に Django の正常動作を確認するには Django のテストスイートを実行します。すべてのテストに合格した場合は、その変更により Django が壊れていないことが確認できます。Django のテストスイートを実行したことが一度もない場合、その出力結果を把握しておくために、一度テストスイートを実行しておくことを推奨します。

source: We can run the test suite by simply ``cd``-ing into the Django ``tests/`` directory and, if you're using GNU/Linux, Mac OS X or some other flavor of Unix, run::
ja: テストスイートの実行は Django の ``tests/`` ディレクトリに `cd`` で移動し、GNU/Linux, Mac OS X 等 Unix 系 OS を利用している場合は以下のコマンドを実行します::

source: If you're on Windows, the above should work provided that you are using "Git Bash" provided by the default Git install. GitHub has a `nice tutorial`__.
ja: Windows の場合は、Git のデフォルトインストールで提供される "Git Bash" を使用することにより上記コマンドが実行できます。GitHub には `素敵なチュートリアル`__ があります。

source: If you're using ``virtualenv``, you can omit ``PYTHONPATH=..`` when running the tests. This instructs Python to look for Django in the parent directory of ``tests``. ``virtualenv`` puts your copy of Django on the ``PYTHONPATH`` automatically.
ja: もし ``virtualenv`` を利用している場合は、テストの実行に ``PYTHONPATH=..`` のステップは不要です。これは Python が Django を見に行く際に ``tests`` の親ディレクトリを見に行くようにします。 ``virtualenv`` が自動的に Django を ``PYTHONPATH`` 上に追加します。

source: Now sit back and relax. Django's entire test suite has over 4800 different tests, so it can take anywhere from 5 to 15 minutes to run, depending on the speed of your computer.
ja: それでは一息つきましょう。Django 全体のテストスイートは 4800 以上のテストが含まれており、コンピュータの速度により 5 〜 15分程度かかります。

source: While Django's test suite is running, you'll see a stream of characters representing the status of each test as it's run. ``E`` indicates that an error was raised during a test, and ``F`` indicates that a test's assertions failed. Both of these are considered to be test failures. Meanwhile, ``x`` and ``s`` indicated expected failures and skipped tests, respectively. Dots indicate passing tests.
ja: Django のテストスイートを実行中に、各テストの状態を文字のストリームで確認することができます。 ``E`` はテストにエラーが発生したことを表し、 ``F`` はテストのアサーションが失敗したことを表しています。これらは共にテスト失敗となります。``x`` と ``s`` はそれぞれ期待する失敗とスキップを表しています。ドットはテストの成功を表しています。

source: Skipped tests are typically due to missing external libraries required to run the test; see :ref:`running-unit-tests-dependencies` for a list of dependencies and be sure to install any for tests related to the changes you are making (we won't need any for this tutorial).
ja: スキップされたテストは、テストを実行するために必要な外部ライブラリがインストールされていないことが原因です; 依存については :ref:`running-unit-tests-dependencies` を参照し、関連するテストを実行してください (このチュートリアルでは必要ありません)。

source: Once the tests complete, you should be greeted with a message informing you whether the test suite passed or failed. Since you haven't yet made any changes to Django's code, the entire test suite **should** pass. If you get failures or errors make sure you've followed all of the previous steps properly. See :ref:`running-unit-tests` for more information.
ja: テストが終了するとテストが成功したか､失敗したかを知らせるメッセージが表示されます｡まだ Django のコードに変更を加えていなければ､テストは全て **パスするはずです** ｡もし失敗するかエラーが起こる場合は､これまでの全ステップを適切に実行してください｡ :ref:`running-unit-tests` で､よりテストについて知れます｡
